import math

print("Лабораторная работа 2, Задание 1 (Вариант 8)\n")

# Ввод сторон треугольника
a = float(input("Введите первую сторону треугольника: "))
b = float(input("Введите вторую сторону треугольника: "))
c = float(input("Введите третью сторону треугольника: "))

# Проверка существования треугольника
if a <= 0 or b <=0 or c <=0:
    print("Ошибка: стороны должны быть > 0 ")
elif (a + b <= c) or (a + c <= b) or (b + c <= a):
    print("Ошибка: треугольника не сущ.")
elif not (a == b or a == c or b == c):
    print("Ошибка: треугольник не равнобедренный")
else:
    p = (a + b + c) / 2
    s = math.sqrt(p * (p - a) * (p - b) * (p - c))

    print(f"\nПлощадь треугольника: {s:.2f}")

    # Проверка на четность
    if s % 2 == 0:
        result = s / 2
        print(f"Площадь четная, делим на 2: {result:.2f}")
    else:
        print("Не могу делить на 2")
