import math

print("Лабораторная работа 1, Задание 1 (Вариант 8)\n")

# Задаем исходные константы
c = 1.35
d = 0.87

print(f"Исходные данные с = {c}, d = {d}")

# Вычисляем промежуточные и итоговую пременные
a = math.log(c + (math.sin(d) ** 2))
x = ((a + d) / (c * d)) * math.sin(c * d)
p = math.sqrt(math.exp(x + 1) + x)

# Вывод результатов с форматированием
print(f"Промежуточное значение a = {a:.2f}")
print(f"Промежуточное значение x = {x:.2f}\n")
print(f"Результат вычисления выражения p = {p:.2f}")
